=====================================
Simple Ellipsis
=====================================

resource "..." "..." {
   ...
}

---

(config_file
  (body
    (block
      (identifier)
      (string_lit
        (quoted_template_start)
        (template_literal)
        (quoted_template_end))
      (string_lit
        (quoted_template_start)
        (template_literal)
        (quoted_template_end))
      (block_start)
      (body
        (semgrep_ellipsis))
      (block_end))))

=====================================
Simple Ellipsis Metavariable
=====================================

resource "..." "..." {
   $...BODY
}

---

(config_file
  (body
    (block
      (identifier)
      (string_lit
        (quoted_template_start)
        (template_literal)
        (quoted_template_end))
      (string_lit
        (quoted_template_start)
        (template_literal)
        (quoted_template_end))
      (block_start)
      (body
        (semgrep_ellipsis_metavar))
      (block_end))))

=====================================
Object Ellipsis
=====================================

policy = jsonencode({
   ...
})


---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (function_call
          (identifier)
          (function_arguments
            (expression
              (collection_value
                (object
                  (object_start)
                  (object_elem
                    (semgrep_ellipsis))
                  (object_end))))))))))

=====================================
Object Ellipsis Metavariable
=====================================

policy = jsonencode({
   $...BODY
})


---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (function_call
          (identifier)
          (function_arguments
            (expression
              (collection_value
                (object
                  (object_start)
                  (object_elem
                    (semgrep_ellipsis_metavar))
                  (object_end))))))))))

=====================================
Ellipsis Expression
=====================================

x = ...

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (semgrep_ellipsis)))))

=====================================
Metavariable Ellipsis Expression
=====================================

x = $...EXPR

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (semgrep_ellipsis_metavar)))))
